html/ostep-con-cv.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>OSTEP / Concurrency-CV</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">OSTEP / Concurrency-CV</h1>
<p>
[OSTEP](<a href="http://pages.cs.wisc.edu/~remzi/OSTEP/">http://pages.cs.wisc.edu/~remzi/OSTEP/</a>)
</p>

<p>
条件变量在实现上可以看做futex + queue. 这个queue里面存储是因为等待这个condition而阻塞的线程
</p>

<p>
A condition variable is an explicit queue that threads can put themselves on when some state  f execution (i.e., some condition) is not as desired (by waiting on the condition); some other thread, when it changes said state, can then wake one (or more) of those waiting threads and thus allow them to continue (by signaling on the condition).
</p>

<p>
Tom West's Law. 不是所有事情都值得做好的
</p>

<blockquote>
<p>
TIP: DON’T ALWAYS DO IT PERFECTLY (TOM WEST’S LAW)
Tom West, famous as the subject of the classic computer-industry book
Soul of a New Machine [K81], says famously: “Not everything worth doing
is worth doing well”, which is a terrific engineering maxim. If a bad
thing happens rarely, certainly one should not spend a great deal of effort
to prevent it, particularly if the cost of the bad thing occurring is small.
If, on the other hand, you are building a space shuttle, and the cost of
something going wrong is the space shuttle blowing up, well, perhaps
you should ignore this piece of advice
</p>
</blockquote>
</div>
</body>
</html>
